_posts/2018-08-14-notomatic-differentiation.org
#+STARTUP: showall indent
#+BEGIN_EXPORT html
---
layout: post
title: "Not-o-matic Differentiation"
excerpt: Summary of my experience working on a Haskell GSoC project.
---
#+END_EXPORT

This summer, I worked on a Google Summer of Code [[https://github.com/ajknapp/accelerate-ad][project]] intended to implement automatic differentiation for Haskell's =accelerate= vector programming EDSL, using a new method of automatic differentiation.
To make a long story short, the differentiation part worked out even better than I hoped, but the automatic part didn't for a variety of reasons which I will detail in this post.

Let's start with the good stuff, however.
The paper for the method that I was using is still unfinished, so I can't say for sure, but I believe I worked out the punchline (with the help of a similar [[https://arxiv.org/abs/1804.00746][paper]] by Conal Elliott): in a purely functional setting, the following combinators are all the infrastructure you need to support vectorized, parallel AD capable of arbitrary mixed-mode computation.

#+BEGIN_SRC haskell
scale a = \da -> a*da
compForward x = (matrixMultiply x .)
compReverse x = (. flip matrixMultiply x)
#+END_SRC

(Of course, you need derivative information for primitives as well.)

