_posts/2018-08-14-notomatic-differentiation.html
---
layout: post
title: "Not-o-matic Differentiation"
excerpt: Summary of my experience working on a Haskell GSoC project.
---

<p>
This summer, I worked on a Google Summer of Code <a href="https://github.com/ajknapp/accelerate-ad">project</a> intended to implement automatic differentiation for Haskell's <code>accelerate</code> vector programming EDSL, using a new method of automatic differentiation.
To make a long story short, the differentiation part worked out even better than I hoped, but the automatic part didn't for a variety of reasons which I will detail in this post.
</p>

<p>
Let's start with the good stuff, however.
The paper for the method that I was using is still unfinished, so I can't say for sure, but I believe I worked out the punchline (with the help of a similar <a href="https://arxiv.org/abs/1804.00746">paper</a> by Conal Elliott): in a purely functional setting, the following combinators are all the infrastructure you need to support vectorized, parallel AD capable of arbitrary mixed-mode computation.
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span class="org-haskell-definition">scale</span> a <span class="org-haskell-operator">=</span> <span class="org-haskell-operator">\</span>da <span class="org-haskell-operator">-&gt;</span> a<span class="org-haskell-operator">*</span>da
<span class="org-haskell-definition">compForward</span> x <span class="org-haskell-operator">=</span> <span class="org-rainbow-delimiters-depth-1">(</span>matrixMultiply x <span class="org-haskell-operator">.</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-haskell-definition">compReverse</span> x <span class="org-haskell-operator">=</span> <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-haskell-operator">.</span> flip matrixMultiply x<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
(Of course, you need derivative information for primitives as well.)
</p>
