_posts/2018-08-14-notomatic-differentiation.html

<div id="outline-container-orgd293c17" class="outline-2">
<h2 id="orgd293c17">Differentiation&#x2026;</h2>
<div class="outline-text-2" id="text-orgd293c17">
<p>
How does this work?
Let's start with forward-mode AD for scalar expressions.
The usual way to do forward-mode AD is with dual numbers:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span class="org-haskell-keyword">newtype</span> <span class="org-haskell-type">D</span> a <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">D</span> a a

<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Num</span> a <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Num</span> <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-haskell-type">D</span> a<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-haskell-keyword">where</span>
  <span class="org-haskell-constructor">D</span> f f' <span class="org-haskell-operator">+</span> <span class="org-haskell-constructor">D</span> g g' <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">D</span> <span class="org-rainbow-delimiters-depth-1">(</span>f<span class="org-haskell-operator">+</span>g<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">(</span>f'<span class="org-haskell-operator">+</span>g'<span class="org-rainbow-delimiters-depth-1">)</span>
  <span class="org-haskell-constructor">D</span> f f' <span class="org-haskell-operator">*</span> <span class="org-haskell-constructor">D</span> g g' <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">D</span> <span class="org-rainbow-delimiters-depth-1">(</span>f<span class="org-haskell-operator">*</span>g<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">(</span>f'<span class="org-haskell-operator">*</span>g <span class="org-haskell-operator">+</span> f<span class="org-haskell-operator">*</span>g'<span class="org-rainbow-delimiters-depth-1">)</span>
  <span class="org-comment-delimiter">-- </span><span class="org-comment">etc.</span>
</pre>
</div>
<p>
Instead of keeping track of the derivative via a number, we can keep track of it with a function (in mathematical terms, we've moved from the usual derivative to the Frechet derivative.)
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span class="org-comment-delimiter">-- </span><span class="org-comment">(-+&gt;) is a linear function</span>
<span class="org-haskell-keyword">type</span> <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-haskell-operator">-+&gt;</span><span class="org-rainbow-delimiters-depth-1">)</span> a b <span class="org-haskell-operator">=</span> a <span class="org-haskell-operator">-&gt;</span> b
<span class="org-haskell-keyword">newtype</span> <span class="org-haskell-type">D</span> a b <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">D</span> <span class="org-rainbow-delimiters-depth-1">(</span>a <span class="org-haskell-operator">-&gt;</span> <span class="org-rainbow-delimiters-depth-2">(</span>a, a <span class="org-haskell-operator">-+&gt;</span> b<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
<p>
In this setting, the automatically differentiated version of <code>square x = x*x</code> would be <code>square = D (\x -&gt; (x*x, scale (2*x)))</code>.
We can also share work between the function and its derivative.
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span class="org-haskell-definition">exp</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">D</span> <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-keyword">let</span> y <span class="org-haskell-operator">=</span> exp x <span class="org-haskell-keyword">in</span> <span class="org-rainbow-delimiters-depth-2">(</span>y, scale y<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
<p>
We can compose <code>D</code> types with their <code>Category</code> instance (exercise for the reader.)
Once we're done composing them, we can get a numerical answer in a straightforward way.
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span class="org-haskell-definition">withDerivative</span> <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-haskell-constructor">D</span> f<span class="org-rainbow-delimiters-depth-1">)</span> x <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">let</span> <span class="org-rainbow-delimiters-depth-1">(</span>y, f'<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-haskell-operator">=</span> f x <span class="org-haskell-keyword">in</span> <span class="org-rainbow-delimiters-depth-1">(</span>y, f' <span class="org-highlight-numbers-number">1.0</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
We can now extend this trick to vector-valued functions by replacing <code>scale x</code> with <code>matrixMultiply x</code>, but there's an added complication, which is the impact of the association of matrix products on performance.
Suppose we have some Jacobians already computed in a staged or lazy way
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span class="org-comment-delimiter">-- </span><span class="org-comment">evaluated at x</span>
<span class="org-haskell-definition">f'</span> <span class="org-haskell-operator">=</span> A.use <span class="org-haskell-operator">$</span> A.fromList <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-haskell-constructor">A.Z</span> <span class="org-haskell-constructor">A.:.</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-highlight-numbers-number">2</span><span class="org-haskell-operator">::</span><span class="org-haskell-type">Int</span><span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-haskell-constructor">A.:.</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-highlight-numbers-number">10</span><span class="org-haskell-operator">::</span><span class="org-haskell-type">Int</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">[</span><span class="org-highlight-numbers-number">0</span><span class="org-haskell-operator">::</span><span class="org-haskell-type">Double</span> <span class="org-haskell-operator">..</span><span class="org-rainbow-delimiters-depth-1">]</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">evaluated at f(x)</span>
<span class="org-haskell-definition">g'</span> <span class="org-haskell-operator">=</span> A.use <span class="org-haskell-operator">$</span> A.fromList <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-haskell-constructor">A.Z</span> <span class="org-haskell-constructor">A.:.</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-highlight-numbers-number">10</span><span class="org-haskell-operator">::</span><span class="org-haskell-type">Int</span><span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-haskell-constructor">A.:.</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-highlight-numbers-number">3</span><span class="org-haskell-operator">::</span><span class="org-haskell-type">Int</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">[</span><span class="org-highlight-numbers-number">0</span><span class="org-haskell-operator">::</span><span class="org-haskell-type">Double</span> <span class="org-haskell-operator">..</span><span class="org-rainbow-delimiters-depth-1">]</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">evaluated at g(f(x))</span>
<span class="org-haskell-definition">h'</span> <span class="org-haskell-operator">=</span> A.use <span class="org-haskell-operator">$</span> A.fromList <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-haskell-constructor">A.Z</span> <span class="org-haskell-constructor">A.:.</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-highlight-numbers-number">3</span><span class="org-haskell-operator">::</span><span class="org-haskell-type">Int</span><span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-haskell-constructor">A.:.</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-highlight-numbers-number">50</span><span class="org-haskell-operator">::</span><span class="org-haskell-type">Int</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">[</span><span class="org-highlight-numbers-number">0</span><span class="org-haskell-operator">::</span><span class="org-haskell-type">Double</span> <span class="org-haskell-operator">..</span><span class="org-rainbow-delimiters-depth-1">]</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">evaluated at h(g(f(x)))</span>
<span class="org-haskell-definition">j'</span> <span class="org-haskell-operator">=</span> A.use <span class="org-haskell-operator">$</span> A.fromList <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-haskell-constructor">A.Z</span> <span class="org-haskell-constructor">A.:.</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-highlight-numbers-number">50</span><span class="org-haskell-operator">::</span><span class="org-haskell-type">Int</span><span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-haskell-constructor">A.:.</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-highlight-numbers-number">80</span><span class="org-haskell-operator">::</span><span class="org-haskell-type">Int</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">[</span><span class="org-highlight-numbers-number">0</span><span class="org-haskell-operator">::</span><span class="org-haskell-type">Double</span> <span class="org-haskell-operator">..</span><span class="org-rainbow-delimiters-depth-1">]</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">evaluated at j(h(g(f(x))))</span>
<span class="org-haskell-definition">k'</span> <span class="org-haskell-operator">=</span> A.use <span class="org-haskell-operator">$</span> A.fromList <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-haskell-constructor">A.Z</span> <span class="org-haskell-constructor">A.:.</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-highlight-numbers-number">80</span><span class="org-haskell-operator">::</span><span class="org-haskell-type">Int</span><span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-haskell-constructor">A.:.</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-highlight-numbers-number">100</span><span class="org-haskell-operator">::</span><span class="org-haskell-type">Int</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">[</span><span class="org-highlight-numbers-number">0</span><span class="org-haskell-operator">::</span><span class="org-haskell-type">Double</span> <span class="org-haskell-operator">..</span><span class="org-rainbow-delimiters-depth-1">]</span>
</pre>
</div>
<p>
and we want to compute the Jacobian of \(f \circ g \circ h \circ j \circ k\).
The chain rule tells us what the answer is: we just matrix-multiply everything.
It doesn't tell us how to do it efficiently, however.
If we have a lot of inputs and a few outputs, we should multiply from left to right (reverse mode); otherwise, going from right to left is a better choice (forward mode.)
We can do this elegantly with the <code>compForward</code> and <code>compReverse</code> combinators.
(Note the analogy between passing <code>id</code> in the matrix case and <code>1.0</code> in the scalar case from earlier, and which matrix gets passed as an argument.)
</p>
<div class="org-src-container">
<pre class="src src-haskell">&#955;<span class="org-haskell-definition">&gt;</span> run <span class="org-haskell-operator">$</span> <span class="org-rainbow-delimiters-depth-1">(</span>compForward f' 
          <span class="org-haskell-operator">.</span> compForward g'
          <span class="org-haskell-operator">.</span> compForward h'
          <span class="org-haskell-operator">.</span> compForward j' <span class="org-haskell-operator">$</span> id<span class="org-rainbow-delimiters-depth-1">)</span> k'
</pre>
</div>
<pre class="example">
Matrix (Z :. 2 :. 100) [...]
(4.70 secs, 8,707,288,416 bytes)

</pre>

<div class="org-src-container">
<pre class="src src-haskell">&#955;<span class="org-haskell-definition">&gt;</span> run <span class="org-haskell-operator">$</span> <span class="org-rainbow-delimiters-depth-1">(</span>compReverse g' 
          <span class="org-haskell-operator">.</span> compReverse h'
          <span class="org-haskell-operator">.</span> compReverse j'
          <span class="org-haskell-operator">.</span> compReverse k' <span class="org-haskell-operator">$</span> id<span class="org-rainbow-delimiters-depth-1">)</span> f'
</pre>
</div>
<pre class="example">
Matrix (Z :. 2 :. 100) [...]
(0.19 secs, 188,243,768 bytes)

</pre>

<p>
It doesn't help in this case, but we can support mixed-mode computation easily: anytime you want to switch modes, just feed the comp train an <code>id</code> and start a new one.
</p>
<div class="org-src-container">
<pre class="src src-haskell">&#955;<span class="org-haskell-definition">&gt;</span> run <span class="org-haskell-operator">$</span> <span class="org-rainbow-delimiters-depth-1">(</span>compForward f' <span class="org-haskell-operator">.</span> compForward g' <span class="org-haskell-operator">$</span> id<span class="org-rainbow-delimiters-depth-1">)</span>
       <span class="org-haskell-operator">.</span> <span class="org-rainbow-delimiters-depth-1">(</span>compReverse j' <span class="org-haskell-operator">.</span> compReverse k' <span class="org-haskell-operator">$</span> id<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-haskell-operator">$</span> h'
</pre>
</div>
<pre class="example">
Matrix (Z :. 2 :. 100) [...]
(0.47 secs, 688,244,264 bytes)

</pre>

<p>
That's the differentiation; all that's left is the automatic part.
</p>
</div>
</div>
