_posts/2018-08-14-notomatic-differentiation.org
* ... of the not-o-matic variety

This was all relatively straightforward (in hindsight, at least), so why didn't I succeed in writing an AD library?

The short answer is "the automatic part."

It's possible to manually write a bunch of =D= combinators and write everything in a point-free style using =Category= instances, but that gets old fast.
You can write half an =Arrow= instance for =D=, but =arr= is up to its usual dirty tricks: we can't differentiate an arbitrary Haskell function.
For this reason, the implementation described in Conal Elliott's paper is intended to be used with his compiling to categories GHC plugin.

Unfortunately, the compiling with categories implementation can't be extended to =accelerate= for two reasons, compiler plugin aside.
Firstly, the way it deals with vectorization is totally incompatible with the way =accelerate= works - it relies on a matrix being a vector of vectors and a bunch of instances that =accelerate= can't support.
But what really is a dealbreaker is the separate =Acc= and =Exp= types in =accelerate=.
=compReverse= and =compForward= are replaced by a category instance in this setting, and you need two separate category instances =k= and =l= to generalize =Acc= and =Exp= functions, respectively.
Say now you want to wrap the =accelerate= function =map :: (Exp a -> Exp b) -> Acc (Array a) -> Acc (Array b)= into something like =mapC :: a `l` b -> a `k` b=.
If you try to write =map f . map g=, you're hit with ambiguous type errors, and you now have to manually thread =Proxy l= arguments everywhere.

Since the whole point of automatic differentiation is to avoid threading derivatives around manually in a mechanical but easy to screw up way, our other choice is to transform =accelerate= syntax trees to thread AD state around.
Unfortunately, [[http://www.acceleratehs.org/publications.html#type-safe-runtime-code-generation-accelerate-to-llvm][Trevor McDonell et al.]] put a lot of effort and thought into making the =accelerate= compiler preserve types as a bug-squashing mechanism.
They did an extremely good job of it - it is indeed extremely hard (perhaps impossible) to write code that changes the type of a function's =accelerate= syntax tree in a generic way.

I'll walk through a few examples of things that are critical for AD that are either very hard or impossible in a generic way with =accelerate=.

** Type-changing function transformations

The AST for =accelerate= array functions has two constructors: =Alam= and =Abody=.
A function of two arguments would get translated to =Alam(Alam(Abody accelerateExpression))=, where =accelerateExpression= has type =OpenAcc aenv t= - basically an AST for expressions that keeps track of result type and the environment of array variables.
Suppose we've written an optimization =f :: OpenAcc f t -> OpenAcc f t=.
We'd like to apply it to functions with arbitrarily many arguments, so we write the following.
#+BEGIN_SRC haskell
applyRewriteAcc k (Abody b) = Abody (k b)
applyRewriteAcc k (Alam f)  = Alam (applyRewriteAcc k f)
#+END_SRC
This gives a type error, and won't compile unless you give it this type signature and turn on =Rank2Types=.
#+BEGIN_SRC haskell
applyRewriteAcc
    :: (forall aenv' t'. OpenAcc aenv' t' -> OpenAcc aenv' t')
    -> PreOpenAfun OpenAcc aenv t
    -> PreOpenAfun OpenAcc aenv t
#+END_SRC
Great - you can now apply your optimization, and you know it's type preserving!
Sadly, this won't work if you try to generalize the signature to something that leaves the environment alone but changes the type of the expression.
Every change I tried to that type signature that would let you apply a general type-changing rewrite gives you a type error.
However, you can get it to work for transformations with somewhat more concrete types (a fixed number of arguments and a "concrete enough" output type.)

Let's try to write a function that rewrites the AST of an =Acc (Vector a) -> Acc (Vector a)= and transforms it to a representation of =Acc (Vector a) -> Acc (Vector a, Matrix a)= - this is the type of our AD transformation in the case where the input is a vector.
When you try to case match on the function's argument =x=, pattern matching on certain constructors gives you a type error.
Indeed, the types of these constructors contradict the type of =x= - but these constructors could show up at a lower level in the syntax tree, and so you have to repeat almost all the patterns twice.

These constructors are a small minority, so you can try to go on with automatic differentiation.
The next problem you run into is dealing with the stream fusion in =accelerate= - it also does not like its types being changed.
I believe it is possible to overcome this - I just left it on the table because there were plenty of things to do that I had no idea how to approach at the time and didn't require a solution to the fusion problem.
Once you've taken care of that, you can automatically differentiate functions of a single array argument, assuming you know the derivatives of everything and how to compose them.

I think with more time, these problems could have been overcome.

