_posts/2018-08-14-notomatic-differentiation.html

<div id="outline-container-org8dda0b3" class="outline-2">
<h2 id="org8dda0b3">&#x2026; of the not-o-matic variety</h2>
<div class="outline-text-2" id="text-org8dda0b3">
<p>
This was all relatively straightforward (in hindsight, at least), so why didn't I succeed in writing an AD library?
</p>

<p>
The short answer is "the automatic part."
</p>

<p>
It's possible to manually write a bunch of <code>D</code> combinators and write everything in a point-free style using <code>Category</code> instances, but that gets old fast.
You can write half an <code>Arrow</code> instance for <code>D</code>, but <code>arr</code> is up to its usual dirty tricks: we can't differentiate an arbitrary Haskell function.
For this reason, the implementation described in Conal Elliott's paper is intended to be used with his compiling to categories GHC plugin.
</p>

<p>
Unfortunately, the compiling with categories implementation can't be extended to <code>accelerate</code> for two reasons, compiler plugin aside.
Firstly, the way it deals with vectorization is totally incompatible with the way <code>accelerate</code> works - it relies on a matrix being a vector of vectors and a bunch of instances that <code>accelerate</code> can't support.
But what really is a dealbreaker is the separate <code>Acc</code> and <code>Exp</code> types in <code>accelerate</code>.
<code>compReverse</code> and <code>compForward</code> are replaced by a category instance in this setting, and you need two separate category instances <code>k</code> and <code>l</code> to generalize <code>Acc</code> and <code>Exp</code> functions, respectively.
Say now you want to wrap the <code>accelerate</code> function <code>map :: (Exp a -&gt; Exp b) -&gt; Acc (Array a) -&gt; Acc (Array b)</code> into something like <code>mapC :: a `l` b -&gt; a `k` b</code>.
If you try to write <code>mapC f . mapC g</code>, you're hit with ambiguous type errors, and you now have to manually thread <code>Proxy l</code> arguments everywhere.
</p>

<p>
Since the whole point of automatic differentiation is to avoid threading derivatives around manually in a mechanical but easy to screw up way, our other choice is to transform <code>accelerate</code> syntax trees to thread AD state around.
Unfortunately, <a href="http://www.acceleratehs.org/publications.html#type-safe-runtime-code-generation-accelerate-to-llvm">Trevor McDonell et al.</a> put a lot of effort and thought into making the <code>accelerate</code> compiler preserve types as a bug-squashing mechanism.
They did an extremely good job of it - it is indeed extremely hard (perhaps impossible) to write code that changes the type of a function's <code>accelerate</code> syntax tree in a generic way.
</p>

<p>
I'll walk through a few examples of things that are critical for AD that are either very hard or impossible in a generic way with <code>accelerate</code>.
</p>
</div>

<div id="outline-container-orgf198159" class="outline-3">
<h3 id="orgf198159">Type-changing function transformations</h3>
<div class="outline-text-3" id="text-orgf198159">
<p>
The AST for <code>accelerate</code> array functions has two constructors: <code>Alam</code> and <code>Abody</code>.
A function of two arguments would get translated to <code>Alam(Alam(Abody accelerateExpression))</code>, where <code>accelerateExpression</code> has type <code>OpenAcc aenv t</code> - basically an AST for expressions that keeps track of result type and the environment of array variables.
Suppose we've written an optimization <code>f :: OpenAcc f t -&gt; OpenAcc f t</code>.
We'd like to apply it to functions with arbitrarily many arguments, so we write the following.
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span class="org-haskell-definition">applyRewriteAcc</span> k <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-haskell-constructor">Abody</span> b<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Abody</span> <span class="org-rainbow-delimiters-depth-1">(</span>k b<span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-haskell-definition">applyRewriteAcc</span> k <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-haskell-constructor">Alam</span> f<span class="org-rainbow-delimiters-depth-1">)</span>  <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Alam</span> <span class="org-rainbow-delimiters-depth-1">(</span>applyRewriteAcc k f<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>
<p>
This gives a type error, and won't compile unless you give it this type signature and turn on <code>Rank2Types</code>.
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span class="org-haskell-definition">applyRewriteAcc</span>
    <span class="org-haskell-operator">::</span> <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-haskell-keyword">forall</span> aenv' t'<span class="org-haskell-operator">.</span> <span class="org-haskell-type">OpenAcc</span> aenv' t' <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">OpenAcc</span> aenv' t'<span class="org-rainbow-delimiters-depth-1">)</span>
    <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">PreOpenAfun</span> <span class="org-haskell-type">OpenAcc</span> aenv t
    <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">PreOpenAfun</span> <span class="org-haskell-type">OpenAcc</span> aenv t
</pre>
</div>
<p>
Great - you can now apply your optimization, and you know it's type preserving!
Sadly, this won't work if you try to generalize the signature to something that leaves the environment alone but changes the type of the expression.
Every change I tried to that type signature that would let you apply a general type-changing rewrite gives you a type error.
However, you can get it to work for transformations with somewhat more concrete types (a fixed number of arguments and a "concrete enough" output type.)
</p>

<p>
Let's try to write a function that rewrites the AST of an <code>Acc (Vector a) -&gt; Acc (Vector a)</code> and transforms it to a representation of <code>Acc (Vector a) -&gt; Acc (Vector a, Matrix a)</code> - this is the type of our AD transformation in the case where the input is a vector.
When you try to case match on the function's argument <code>x</code>, pattern matching on certain constructors gives you a type error.
Indeed, the types of these constructors contradict the type of <code>x</code> - but these constructors could show up at a lower level in the syntax tree, and so you have to repeat almost all the patterns twice.
</p>

<p>
These constructors are a small minority, so you can try to go on with automatic differentiation.
The next problem you run into is dealing with the stream fusion in <code>accelerate</code> - it also does not like its types being changed.
I believe it is possible to overcome this - I just left it on the table because there were plenty of things to do that I had no idea how to approach at the time and didn't require a solution to the fusion problem.
Once you've taken care of that, you can automatically differentiate functions of a single array argument, assuming you know the derivatives of everything and how to compose them.
</p>

<p>
I think with more time, these problems could have been overcome.
</p>
</div>
</div>
