_posts/2018-08-14-notomatic-differentiation.org
** Adding a constant to a syntax tree in a type-preserving manner

At one point, I got stuck on the problem of adding a constant to an =accelerate= syntax tree (in a type-preserving manner, so nothing in the previous section applied.)
This is the code that Trevor sent back, and I'm grateful he did, because I'd have been stuck for a very long time.
#+BEGIN_SRC haskell
    -- This is kind of a hack? We can traverse the representation of any type
    -- down to primitive values in order to get a zero.
    --
    delta :: forall env c. Elt c => Int -> Int -> PreOpenExp acc env aenv c
    delta i' j' = Const $ go (eltType (undefined::c))
      where
        go :: TupleType a -> a
        go TypeRunit         = ()
        go (TypeRpair ta tb) = (go ta, go tb)
        go (TypeRscalar t)   = scalar t

        scalar :: ScalarType a -> a
        scalar (SingleScalarType t) = single t
        scalar (VectorScalarType t) = vector t

        vector :: VectorType a -> a
        vector (Vector2Type t) = let x = single t in V2 x x

        single :: SingleType a -> a
        single (NumSingleType    t) = num t
        single (NonNumSingleType t) = nonnum t

        num :: NumType a -> a
        num (IntegralNumType t) | IntegralDict <- integralDict t = if i' == j' then 1 else 0
        num (FloatingNumType t) | FloatingDict <- floatingDict t = if i' == j' then 1 else 0

        nonnum :: NonNumType a -> a
        nonnum = undefined -- uh..?
#+END_SRC
It turns out =accelerate= has a generics implementation in it that knows about most of the types it compiles.

** Tensor contractions

=accelerate= supports multidimensional arrays, not just vectors and matrices.
Although the output of a function might be a vector or a matrix, there's a good chance a higher rank array shows up in an intermediate step.
The generalized Jacobian of a function $f$ between higher rank arrays looks like \[
D_{\mu_1\mu_2\cdots \mu_m \nu_1 \nu_2 \cdots \nu_n}(f) = \frac{\partial f_{\mu_1\mu_2\cdots \mu_m}}{\partial g_{\nu_1\nu_2\cdots \nu_n}}
\]
To compose two of these functions, we use the chain rule \[
D_{\mu_1\mu_2\cdots \mu_m \lambda_1 \lambda_2\cdots \lambda_p}(f \circ g) = D_{\mu_1\mu_2\cdots \mu_m \nu_1 \nu_2 \cdots \nu_n}(f) \circ D_{\nu_1\nu_2\cdots \nu_n \lambda_1 \lambda_2 \cdots \lambda_p}(g) = \frac{\partial f_{\mu_1\mu_2\cdots \mu_m}}{\partial g_{\nu_1\nu_2\cdots \nu_n}} \frac{\partial g_{\nu_1\nu_2\cdots \nu_n}}{\partial x_{\lambda_1\lambda_2\cdots \lambda_p}}
\]
This may be possible to do in =accelerate= generically, but I'm confident it isn't possible without some new primitives.
On the other hand, the vectorization of =accelerate= combinators over inner dimensions might mean we don't need full generality due to sparsity.
I still need to think about this more, especially in the cases of mappings from arrays of rank $n$ to rank $n+1$ and rank $n$ to rank $n-1$.

** Differentiation of accelerate combinators 

Since =accelerate= is a vector language, we can't build up differentiation purely from basic operations.
We have to differentiate combinators as they are. (I did this in detail for folds [[https://ajknapp.github.io/2018/06/01/analytic-folds.html][here]].)
Unfortunately, folds are a misleading example, in that you get the honest generalized Jacobian.
In the generic case, you get a sparse tensor in a combinator-specific format.
Moreover, the set of combinators in the =accelerate= AST is not differentially closed, but you can avoid using most of the ones that break differential closedness.
Most of these can or should be translatable to standard sparse tensor formats, but I don't know for sure.

On the minus side, =accelerate= will need to support tensor contraction for all pairs of sparse formats.
On the plus side, this implies a very high potential for performance.

** Dealing with tuples

Tuples are easy enough to deal with in expressions, but they make life difficult when they are function arguments.
In the generic case, you end up having to compose linear maps that have different ranks in different parts of the tuple.
You also have to smoothly join tuple-based matrix/tensor contraction with array-based contraction.
Supporting the stencil operations in =accelerate= will most likely have to be done by converting them to =generate= expressions.

** Hessians and beyond

I need to think more about how to support higher-order scalar and vector derivatives with this method - there was just not enough time to do so.
The abstract of the draft paper I was sent mentioned a solution to this, but that section wasn't written yet.

