_posts/2018-08-14-notomatic-differentiation.html

<div id="outline-container-orgffa2d7b" class="outline-3">
<h3 id="orgffa2d7b">Adding a constant to a syntax tree in a type-preserving manner</h3>
<div class="outline-text-3" id="text-orgffa2d7b">
<p>
At one point, I got stuck on the problem of adding a constant to an <code>accelerate</code> syntax tree (in a type-preserving manner, so nothing in the previous section applied.)
This is the code that Trevor sent back, and I'm grateful he did, because I'd have been stuck for a very long time.
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span class="org-comment-delimiter">-- </span><span class="org-comment">This is kind of a hack? We can traverse the representation of any type</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">down to primitive values in order to get a zero.</span>
<span class="org-comment-delimiter">--</span>
<span class="org-haskell-definition">delta</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-keyword">forall</span> env c<span class="org-haskell-operator">.</span> <span class="org-haskell-type">Elt</span> c <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Int</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Int</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">PreOpenExp</span> acc env aenv c
<span class="org-haskell-definition">delta</span> i' j' <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Const</span> <span class="org-haskell-operator">$</span> go <span class="org-rainbow-delimiters-depth-1">(</span>eltType <span class="org-rainbow-delimiters-depth-2">(</span>undefined<span class="org-haskell-operator">::</span>c<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
  <span class="org-haskell-keyword">where</span>
    go <span class="org-haskell-operator">::</span> <span class="org-haskell-type">TupleType</span> a <span class="org-haskell-operator">-&gt;</span> a
    go <span class="org-haskell-constructor">TypeRunit</span>         <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor"><span class="org-rainbow-delimiters-depth-1">()</span></span>
    go <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-haskell-constructor">TypeRpair</span> ta tb<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-haskell-operator">=</span> <span class="org-rainbow-delimiters-depth-1">(</span>go ta, go tb<span class="org-rainbow-delimiters-depth-1">)</span>
    go <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-haskell-constructor">TypeRscalar</span> t<span class="org-rainbow-delimiters-depth-1">)</span>   <span class="org-haskell-operator">=</span> scalar t

    scalar <span class="org-haskell-operator">::</span> <span class="org-haskell-type">ScalarType</span> a <span class="org-haskell-operator">-&gt;</span> a
    scalar <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-haskell-constructor">SingleScalarType</span> t<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-haskell-operator">=</span> single t
    scalar <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-haskell-constructor">VectorScalarType</span> t<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-haskell-operator">=</span> vector t

    vector <span class="org-haskell-operator">::</span> <span class="org-haskell-type">VectorType</span> a <span class="org-haskell-operator">-&gt;</span> a
    vector <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-haskell-constructor">Vector2Type</span> t<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">let</span> x <span class="org-haskell-operator">=</span> single t <span class="org-haskell-keyword">in</span> <span class="org-haskell-constructor">V2</span> x x

    single <span class="org-haskell-operator">::</span> <span class="org-haskell-type">SingleType</span> a <span class="org-haskell-operator">-&gt;</span> a
    single <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-haskell-constructor">NumSingleType</span>    t<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-haskell-operator">=</span> num t
    single <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-haskell-constructor">NonNumSingleType</span> t<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-haskell-operator">=</span> nonnum t

    num <span class="org-haskell-operator">::</span> <span class="org-haskell-type">NumType</span> a <span class="org-haskell-operator">-&gt;</span> a
    num <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-haskell-constructor">IntegralNumType</span> t<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">IntegralDict</span> <span class="org-haskell-operator">&lt;-</span> integralDict t <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">if</span> i' <span class="org-haskell-operator">==</span> j' <span class="org-haskell-keyword">then</span> <span class="org-highlight-numbers-number">1</span> <span class="org-haskell-keyword">else</span> <span class="org-highlight-numbers-number">0</span>
    num <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-haskell-constructor">FloatingNumType</span> t<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">FloatingDict</span> <span class="org-haskell-operator">&lt;-</span> floatingDict t <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">if</span> i' <span class="org-haskell-operator">==</span> j' <span class="org-haskell-keyword">then</span> <span class="org-highlight-numbers-number">1</span> <span class="org-haskell-keyword">else</span> <span class="org-highlight-numbers-number">0</span>

    nonnum <span class="org-haskell-operator">::</span> <span class="org-haskell-type">NonNumType</span> a <span class="org-haskell-operator">-&gt;</span> a
    nonnum <span class="org-haskell-operator">=</span> undefined <span class="org-comment-delimiter">-- </span><span class="org-comment">uh..?</span>
</pre>
</div>
<p>
It turns out <code>accelerate</code> has a generics implementation in it that knows about most of the types it compiles.
</p>
</div>
</div>

<div id="outline-container-org5b8f239" class="outline-3">
<h3 id="org5b8f239">Tensor contractions</h3>
<div class="outline-text-3" id="text-org5b8f239">
<p>
<code>accelerate</code> supports multidimensional arrays, not just vectors and matrices.
Although the output of a function might be a vector or a matrix, there's a good chance a higher rank array shows up in an intermediate step.
The generalized Jacobian of a function \(f\) between higher rank arrays looks like \[
D_{\mu_1\mu_2\cdots \mu_m \nu_1 \nu_2 \cdots \nu_n}(f) = \frac{\partial f_{\mu_1\mu_2\cdots \mu_m}}{\partial g_{\nu_1\nu_2\cdots \nu_n}}
\]
To compose two of these functions, we use the chain rule \[
D_{\mu_1\mu_2\cdots \mu_m \lambda_1 \lambda_2\cdots \lambda_p}(f \circ g) = D_{\mu_1\mu_2\cdots \mu_m \nu_1 \nu_2 \cdots \nu_n}(f) \circ D_{\nu_1\nu_2\cdots \nu_n \lambda_1 \lambda_2 \cdots \lambda_p}(g) = \frac{\partial f_{\mu_1\mu_2\cdots \mu_m}}{\partial g_{\nu_1\nu_2\cdots \nu_n}} \frac{\partial g_{\nu_1\nu_2\cdots \nu_n}}{\partial x_{\lambda_1\lambda_2\cdots \lambda_p}}
\]
This may be possible to do in <code>accelerate</code> generically, but I'm confident it isn't possible without some new primitives.
On the other hand, the vectorization of <code>accelerate</code> combinators over inner dimensions might mean we don't need full generality due to sparsity.
I still need to think about this more, especially in the cases of mappings from arrays of rank \(n\) to rank \(n+1\) and rank \(n\) to rank \(n-1\).
</p>
</div>
</div>

<div id="outline-container-orga82886b" class="outline-3">
<h3 id="orga82886b">Differentiation of accelerate combinators</h3>
<div class="outline-text-3" id="text-orga82886b">
<p>
Since <code>accelerate</code> is a vector language, we can't build up differentiation purely from basic operations.
We have to differentiate combinators as they are. (I did this in detail for folds <a href="https://ajknapp.github.io/2018/06/01/analytic-folds.html">here</a>.)
Unfortunately, folds are a misleading example, in that you get the honest generalized Jacobian.
In the generic case, you get a sparse tensor in a combinator-specific format.
Moreover, the set of combinators in the <code>accelerate</code> AST is not differentially closed, but you can avoid using most of the ones that break differential closedness.
Most of these can or should be translatable to standard sparse tensor formats, but I don't know for sure.
</p>

<p>
On the minus side, <code>accelerate</code> will need to support tensor contraction for all pairs of sparse formats.
On the plus side, this implies a very high potential for performance.
</p>
</div>
</div>

<div id="outline-container-orgf46d498" class="outline-3">
<h3 id="orgf46d498">Dealing with tuples</h3>
<div class="outline-text-3" id="text-orgf46d498">
<p>
Tuples are easy enough to deal with in expressions, but they make life difficult when they are function arguments.
In the generic case, you end up having to compose linear maps that have different ranks in different parts of the tuple.
You also have to smoothly join tuple-based matrix/tensor contraction with array-based contraction.
Supporting the stencil operations in <code>accelerate</code> will most likely have to be done by converting them to <code>generate</code> expressions.
</p>
</div>
</div>

<div id="outline-container-orgc556c2f" class="outline-3">
<h3 id="orgc556c2f">Hessians and beyond</h3>
<div class="outline-text-3" id="text-orgc556c2f">
<p>
I need to think more about how to support higher-order scalar and vector derivatives with this method - there was just not enough time to do so.
The abstract of the draft paper I was sent mentioned a solution to this, but that section wasn't written yet.
</p>
</div>
</div>
</div>
